{"/about/":{"data":{"":"rpxy [ahr-pik-see] is designed to be a high-performance, secure, and reliable HTTP reverse-proxy. It is built on top of the Rust programming language and Rust ecosystem libraries. rpxy is designed to be a drop-in replacement for the popular HTTP reverse proxies such as NGINX and Caddy, considering performance-focused environment.\nrpxy is built under the concepts of simple configuration, blazingly fast message handling, and secure by default. It is also designed to be a high-performance HTTP reverse-proxy that can handle a large number of concurrent connections with minimal resource usage.","credits#Credits":"rpxy cannot be built without the following projects and inspirations:\nhyper and hyperium/h3\nrustls\ntokio\nquinn\ns2n-quic\nrustls-acme"},"title":"About"},"/docs/":{"data":{"":" Get Started About "},"title":"Documentation"},"/docs/guide/installation/":{"data":{"":"","buildinginstallation-of-rpxy#Building/Installation of \u003ccode\u003erpxy\u003c/code\u003e":"Building/Installation of rpxy Building from Source You can build an executable binary yourself by checking out this Git repository.\n# Cloning the git repository % git clone https://github.com/junkurihara/rust-rpxy % cd rust-rpxy # Update submodules % git submodule update --init # Build (default: QUIC and HTTP/3 is enabled using `quinn`) % cargo build --release # If you want to use `s2n-quic`, build as follows. You may need several additional dependencies. % cargo build --no-default-features --features http3-s2n --release Then you have an executive binary rust-rpxy/target/release/rpxy.\nℹ️ Note that we do not have an option of installation via crates.io, i.e., cargo install, at this point since some dependencies are not published yet. Alternatively, you can use docker image (see below) as the easiest way for amd64 environment. Package Installation for Linux (RPM/DEB) You can find the Jenkins CI/CD build scripts for rpxy in the ./.build directory.\nPrebuilt packages for Linux RPM and DEB are available at https://rpxy.gamerboy59.dev, provided by @Gamerboy59."},"title":"Installation"}}